home/.config/doom/doom.org
#+export_exclude_tags: exclude noexport

* Table of Contents :TOC:QUOTE:FOLD:
:PROPERTIES:
:CUSTOM_ID: table-of-contents
:VISIBILITY: folded
:END:

#+html:<details><summary>Table of Contents</summary>
#+BEGIN_QUOTE
- [[#doom][Doom]]
  - [[#about][About]]
  - [[#resources][Resources]]
- [[#initial-setup][Initial Setup]]
  - [[#constants][Constants]]
  - [[#search-path][Search Path]]
  - [[#system-settings][System Settings]]
  - [[#personal-information][Personal Information]]
- [[#global][Global]]
  - [[#behavior][Behavior]]
  - [[#keybinds][Keybinds]]
- [[#interface][Interface]]
  - [[#font][Font]]
  - [[#theme][Theme]]
  - [[#cursor][Cursor]]
  - [[#frame][Frame]]
  - [[#modeline][Modeline]]
  - [[#line-numbers][Line Numbers]]
  - [[#dashboard][Dashboard]]
  - [[#help][Help]]
  - [[#completion][Completion]]
  - [[#jumping][Jumping]]
  - [[#lookup][Lookup]]
- [[#utilities][Utilities]]
  - [[#project-management][Project Management]]
  - [[#terminal][Terminal]]
  - [[#directory][Directory]]
  - [[#organization][Organization]]
  - [[#ebooks][Ebooks]]
- [[#languages][Languages]]
  - [[#shell][Shell]]
- [[#experiments][Experiments]]
#+END_QUOTE
#+html:</details>

* Doom
:PROPERTIES:
:VISIBILITY: children
:END:

#+begin_quote
[[https://github.com/doomemacs/doomemacs][Doom]] is a configuration framework for GNU Emacs tailored for Emacs bankruptcy veterans who want less framework in their frameworks, a modicum of stability (and reproducibility) from their package manager, and the performance of a hand rolled config (or better). It can be a foundation for your own config or a resource for Emacs enthusiasts to learn more about our favorite operating system.
#+end_quote

** About

=Configuring Emacs is an art form... and it can get ugly.=

*** Config Files

=Doom uses three config files, loaded in a specific order.=

#+begin_quote
[!IMPORTANT]
It's imperative that your configuration is loaded in the correct time and place. My configuration files are dynamically generated (tangled) from this =README.org= file using [[https://orgmode.org/][org-mode]]. The load order perceived does not reflect the actual source code.

See [[#literate-configuration][Literate Configuration]] for more information.
#+end_quote

- Init.el :: Defines which of Doom’s modules are enabled.
- Packages.el :: Defines external packages to be loaded by Doom.
- Config.el :: Defines the user's custom configuration.

*** Literate Configuration

#+begin_quote
An org-mode [[https://leanpub.com/lit-config/read][Literate Configuration]] enables you to dynamically mix documentation, source code, languages, formats, images, tables, and more in your config files! It primarily provides the ability to non-linearly generate source files from documentation, such as this.
#+end_quote

**** File Generation

Only the =config.el= and =packages.el= files are generated from this file. I don't generate the =init.el= file since I prefer to avoid adding its length to this file and instead manually toggle Doom's modules.

There is also some question regarding whether or not my generated modules file would prevent me from recieving an updated modules list from Doom.

**** Organization

This file is structured to promote discoverability and comprehension. In general, each section follows a scheme similar to this:

#+begin_quote
*Section*
- Variables
- Appearance
- Behavior
- Keybinds
- Fixes
#+end_quote

*** Coding Conventions
**** Naming

- I try to use a descriptive and generalized name for any emacs-lisp that I write, unless writing or extending a package.
- For functions and variables that do not fit into or extend a package I use the prefix =my/= to denote code specific to me.
- Hook function names should end in =-h=.
- Variables that hold the name of a function to be executed should end in =-fn=.
- Custom packages should only contain functions whose name begins with the file name as a prefix.
- I try to adhere to standard Emacs naming conventions and avoid Doom's naming conventions as they're confusing and often not applied correctly.

**** Dependencies

- I try to avoid Doom specific libraries and macros to promote reuse in other Emacs configurations.
- All custom packages should include =require= statements to load their dependencies.

** Resources

#+html:<details><summary>Other Emacs User Configurations</summary>

*** Doom Users

- [[https://github.com/tecosaur/emacs-config][Tecosaur]]
- [[https://github.com/zzamboni/dot-doom/blob/master/doom.org][Zzamboni]]
- [[https://github.com/elken/doom][Elken]]
- [[https://github.com/hieutkt/dotfiles/tree/main/emacs/.doom.d][Nguyen Duc Hieu]]
- [[https://github.com/slano-ls/Doom-Emacs-Config][Saihaj Law]]
- [[https://github.com/chrisbarrett/doom-configuration][Chris Barrett]]
- [[https://github.com/hlissner/.doom.d/tree/master][Henrik Lissner]]
- [[https://github.com/tefkah/doom-emacs-config][Tefkah]]

*** Emacs Users

- [[https://github.com/daviwil/dotfiles/][David Wilson]]
- [[https://github.com/rougier/dotemacs/tree/master][Nicolas P. Rougier]]
- [[https://github.com/jimeh/.emacs.d][Emacs Siren]]
- [[https://github.com/howardabrams/hamacs][Howard Abrams]]
- [[https://github.com/novoid/dot-emacs/blob/master/config.org][Novoid]]
- [[https://github.com/ianyepan/.wsl-emacs.d][Ian Y.E. Pan]]
- [[https://github.com/abougouffa/minemacs/tree/main][Abdelhak Bougouffa - Minemacs]]
- [[https://github.com/yantar92/emacs-config][Ihor Radchenko]]

#+html:</details>

*** Tips and Tricks

- To quickly visit the source code for a package use: =straight-visit-package=.

- To quickly visit the website for a package use: =straight-visit-package-website=.

- To quickly browse the contents of a source code file, use =imenu= or =consult-imenu= (=SPC s i=) to see and jump through its definitions.

- To save and interact with a list of results from the minibuffer use =embark-collect= (=C-c C-l=) to move them to their own buffer.

* Initial Setup
:PROPERTIES:
:VISIBILITY: children
:END:
** File Headers :noexport:
*** Init.el
*** Config.el

#+begin_src emacs-lisp :tangle ./config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

*** Packages.el

#+begin_src emacs-lisp :tangle ./packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
#+end_src

** Constants
*** Home Directory

#+begin_src emacs-lisp :noeval :tangle ./config.el
(defconst user-home-directory (getenv "HOME")
  "Filepath of the user's home directory.")
#+end_src

*** System Name

#+begin_src emacs-lisp :noeval :tangle ./config.el
(defconst user-system-name (string-remove-suffix ".local" (system-name))
    "Name of the user's system.")
#+end_src

** Search Path

Add the lisp subdirectory to the load-path for my custom packages.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(add-to-list 'load-path (expand-file-name "lisp" doom-user-dir))
#+end_src

** System Settings

#+begin_quote
[[file:lisp/system-settings.el][System-Settings]] is a simple library to use an alist to store and retrieve per-system settings. Inspired by [[https://github.com/daviwil/dotfiles/][David Wilson]].
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el
(use-package! system-settings
  :config
  (setq system-settings-list
      (append
       ;; Put system-specific settings at the front so they're found first.
       (when (string= user-system-name "Ganymede")
         '((wm-command . "yabai -m window --")
           (wm-focus-command . "focus")
           (wm-move-command . "swap")
           (wm-direction-left . "west")
           (wm-direction-right . "east")
           (wm-direction-up . "north")
           (wm-direction-down . "south")))
       ;; Put default settings after system-specific settings.
       '((wm-command . "i3-msg ")
         (wm-focus-command . "focus")
         (wm-move-command . "move")
         (wm-direction-left . "left")
         (wm-direction-right . "right")
         (wm-direction-up . "up")
         (wm-direction-down . "down")))))
#+end_src

** Personal Information

Defines an identity for use with GPG, email, and file templates/snippets.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(when (string= user-login-name "noncog")
  (setq user-full-name "noncog"
        user-mail-address "noncog@github.com"))
#+end_src

* Global
:PROPERTIES:
:VISIBILITY: children
:END:
** Behavior
*** Autoload File Changes

If the file changes on disk, update the buffer displaying it.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(global-auto-revert-mode 1)
#+end_src

*** Enable Evil Fine Undo

By default, all changes made while using insert mode are considered one.

This setting enables a more granular undo scheme.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(setq evil-want-fine-undo t)
#+end_src

*** Enable Subword Mode

Allows iterating through CamelCase words.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(global-subword-mode 1)
#+end_src

*** Prevent Pasting From Adding to Kill Ring

Whenever you overwrite text in visual mode, prevent adding that text to the kill ring.

This enables you to paste the same thing multiple times without losing it.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(setq evil-kill-on-visual-paste nil)
#+end_src

*** Focus New Windows After Splitting

#+begin_src emacs-lisp :noeval :tangle ./config.el
(setq evil-split-window-below t
      evil-vsplit-window-right t)
#+end_src

*** Window Manager Integration

#+begin_quote
[[file:lisp/wm.el][Window-Manager]] is a small library I created to integrate Emacs and window manager commands, allowing the use of universal window management keybinds inside and outside of Emacs.
#+end_quote

Define my configurations per-system (different window managers) using my [[file:lisp/system-settings.el][System-Settings]] library.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(use-package! wm
  :config
  (setq wm-command (system-settings-get 'wm-command)
        wm-focus-command (system-settings-get 'wm-focus-command)
        wm-move-command (system-settings-get 'wm-move-command)
        wm-direction-left (system-settings-get 'wm-direction-left)
        wm-direction-right (system-settings-get 'wm-direction-right)
        wm-direction-up (system-settings-get 'wm-direction-up)
        wm-direction-down (system-settings-get 'wm-direction-down))
  ;; I use super as my window manager modifier key.
  ;; These binds allow the window manager windowing keybinds to work within Emacs.
  (map! (:map global-map
              "s-h" #'wm-focus-win-left
              "s-j" #'wm-focus-win-down
              "s-k" #'wm-focus-win-up
              "s-l" #'wm-focus-win-right
              "s-H" #'wm-move-win-left
              "s-J" #'wm-move-win-down
              "s-K" #'wm-move-win-up
              "s-L" #'wm-move-win-right
              "s-=" #'balance-windows
              "s-v" #'evil-window-vsplit
              "s-s" #'evil-window-split
              "s-Q" #'evil-quit))
  ;; These binds allow you to use Doom's window management keybinds from Emacs to windows outside of it.
  (map! :leader "w h" #'wm-focus-win-left
        "w j" #'wm-focus-win-down
        "w k" #'wm-focus-win-up
        "w l" #'wm-focus-win-right
        "w H" #'wm-move-win-left
        "w J" #'wm-move-win-down
        "w K" #'wm-move-win-up
        "w L" #'wm-move-win-right)
  ;; These binds allow you to resize windows directionally.
  ;; These echo the window manager functionality but are not fully integrated yet.
  (map! "C-s-h" #'wm-resize-win-left
        "C-s-j" #'wm-resize-win-down
        "C-s-k" #'wm-resize-win-up
        "C-s-l" #'wm-resize-win-right))
#+end_src

*** Scrolling

This is an area of contention for me. Eventually I would like to overhaul this behavior entirely.

**** Set Scroll Amount

For now, reduce scrolling from half-pages to a smaller line count.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(setq-default evil-scroll-count 10)
#+end_src

** Keybinds
:PROPERTIES:
:VISIBILITY: children
:END:
*** Modifiers

On macOS I translate the modifer keys to mirror Linux.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(when (featurep :system 'macos)
  (setq mac-command-modifier 'control ; Maps Command -> Control
        mac-control-modifier 'meta    ; Maps Control -> Alt (Meta)
        mac-option-modifier 'super))  ; Maps Option -> Super
#+end_src

