home/.config/doom/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

(defconst user-home-directory (getenv "HOME")
  "Filepath of the user's home directory.")

(defconst user-system-name (string-remove-suffix ".local" (system-name))
    "Name of the user's system.")

(add-to-list 'load-path (expand-file-name "lisp" doom-user-dir))

(use-package! system-settings
  :config
  (setq system-settings-list
      (append
       ;; Put system-specific settings at the front so they're found first.
       (when (string= user-system-name "Ganymede")
         '((wm-command . "yabai -m window --")
           (wm-focus-command . "focus")
           (wm-move-command . "swap")
           (wm-direction-left . "west")
           (wm-direction-right . "east")
           (wm-direction-up . "north")
           (wm-direction-down . "south")))
       ;; Put default settings after system-specific settings.
       '((wm-command . "i3-msg ")
         (wm-focus-command . "focus")
         (wm-move-command . "move")
         (wm-direction-left . "left")
         (wm-direction-right . "right")
         (wm-direction-up . "up")
         (wm-direction-down . "down")))))

(when (string= user-login-name "noncog")
  (setq user-full-name "noncog"
        user-mail-address "noncog@github.com"))

(global-auto-revert-mode 1)

(setq evil-want-fine-undo t)

(global-subword-mode 1)

(setq evil-kill-on-visual-paste nil)

(setq evil-split-window-below t
      evil-vsplit-window-right t)

(use-package! wm
  :config
  (setq wm-command (system-settings-get 'wm-command)
        wm-focus-command (system-settings-get 'wm-focus-command)
        wm-move-command (system-settings-get 'wm-move-command)
        wm-direction-left (system-settings-get 'wm-direction-left)
        wm-direction-right (system-settings-get 'wm-direction-right)
        wm-direction-up (system-settings-get 'wm-direction-up)
        wm-direction-down (system-settings-get 'wm-direction-down))
  ;; I use super as my window manager modifier key.
  ;; These binds allow the window manager windowing keybinds to work within Emacs.
  (map! (:map global-map
              "s-h" #'wm-focus-win-left
              "s-j" #'wm-focus-win-down
              "s-k" #'wm-focus-win-up
              "s-l" #'wm-focus-win-right
              "s-H" #'wm-move-win-left
              "s-J" #'wm-move-win-down
              "s-K" #'wm-move-win-up
              "s-L" #'wm-move-win-right
              "s-=" #'balance-windows
              "s-v" #'evil-window-vsplit
              "s-s" #'evil-window-split
              "s-Q" #'evil-quit))
  ;; These binds allow you to use Doom's window management keybinds from Emacs to windows outside of it.
  (map! :leader "w h" #'wm-focus-win-left
        "w j" #'wm-focus-win-down
        "w k" #'wm-focus-win-up
        "w l" #'wm-focus-win-right
        "w H" #'wm-move-win-left
        "w J" #'wm-move-win-down
        "w K" #'wm-move-win-up
        "w L" #'wm-move-win-right)
  ;; These binds allow you to resize windows directionally.
  ;; These echo the window manager functionality but are not fully integrated yet.
  (map! "C-s-h" #'wm-resize-win-left
        "C-s-j" #'wm-resize-win-down
        "C-s-k" #'wm-resize-win-up
        "C-s-l" #'wm-resize-win-right))

(setq-default evil-scroll-count 10)

(when (featurep :system 'macos)
  (setq mac-command-modifier 'control ; Maps Command -> Control
        mac-control-modifier 'meta    ; Maps Control -> Alt (Meta)
        mac-option-modifier 'super))  ; Maps Option -> Super

(map! :leader "h T" nil
