home/.config/doom/doom.org
*** Profiler

Move Doom's profiler toggle keybind from the 'help' leader key list to the 'toggle' list.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(map! :leader "h T" nil
      :leader "t T" #'doom/toggle-profiler)
#+end_src

*** Frame Opacity

Add a keybind to toggle frame opacity.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(map! :leader "t o" #'doom/set-frame-opacity)
#+end_src

* Interface
:PROPERTIES:
:VISIBILITY: children
:END:
** Font

I mostly use Jetbrains Mono or Fira Code fonts.

Currently only setting the font on Linux based systems.

Fonts can cause performance issues on macOS.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(when (and (doom-font-exists-p "JetBrains Mono")
           (featurep :system 'linux))
           (setq doom-font (font-spec :family "JetBrains Mono" :size 14)
                 doom-big-font (font-spec :family "JetBrains Mono" :size 16)))
#+end_src

** Theme

#+begin_src emacs-lisp :noeval :tangle ./config.el
(setq doom-theme 'doom-one)
#+end_src

*** Keybinds

Move Doom's theme changing keybinds from the 'help' leader keymap to the 'toggle' map.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(map! :leader "h t" nil
      :leader "t t" #'load-theme)
#+end_src

** Cursor

Draw the block cursor as wide as the glyph under it.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(setq-default x-stretch-cursor t)
#+end_src

** Frame
:PROPERTIES:
:VISIBILITY: children
:END:
*** Appearance
**** Enable Round Corners and No Title Bar

On macOS and when using Emacs 29+, I like to use rounded window corners with no title bar.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(when (and (featurep :system 'macos)
           (>= emacs-major-version 29))
           (add-to-list 'default-frame-alist '(undecorated-round . t)))
#+end_src

*** Behavior
**** Prevent Frame Resizing Due to Font/Face Changes

On macOS with Yabai, toggling =doom-big-font-mode= was causing the frame to resize and lose window management. This fixes that.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(when (and (featurep :system 'macos)
           (>= emacs-major-version 29))
      (setq frame-inhibit-implied-resize '(font font-backend tab-bar-lines)))
#+end_src

*** Keybinds

Remove frame fullscreen keybind.

It breaks on macOS and I use window managers for the same functionality.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(map! "C-s-f" nil
      :leader "t F" nil)
#+end_src

** Modeline
*** Doom Modeline

#+begin_quote
[[https://github.com/seagle0128/doom-modeline][Doom-Modeline]] is a fancy and fast mode-line inspired by minimalism design.
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el
(use-package! doom-modeline
  :defer t
  :config
  (setq doom-modeline-height 25
        doom-modeline-icon t
        doom-modeline-buffer-file-true-name t
        doom-modeline-project-detection 'auto
        doom-modeline-buffer-file-name-style 'relative-from-project
        doom-modeline-major-mode-icon nil
        doom-modeline-vcs-max-length 60
        auto-revert-check-vc-info t))
#+end_src

** Line Numbers

- I use relative visual line numbers to move around.
- Prevent shifting buffer contents when line numbers grow.
- Disable line numbers in org-mode.

#+begin_src emacs-lisp :tangle ./config.el
(setq display-line-numbers-type 'visual
      display-line-numbers-grow-only t)
(add-hook 'org-mode-hook #'doom-disable-line-numbers-h)
#+end_src

** Dashboard

Always use home directory as =default-directory= instead of recent file/project.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(setq +doom-dashboard-pwd-policy user-home-directory) ;; NOTE: uses personal constant.
#+end_src

** Help
*** Helpful

#+begin_quote
[[https://github.com/Wilfred/helpful][Helpful]] is an alternative to the built-in Emacs help that provides much more contextual information.
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! helpful
  :defer t
  :config
  <<helpful-config>>)
#+end_src

**** Behavior
***** Increase Max Window Count

Increase the window count to be able to move back and forth between more help windows using the keybinds that I set.

#+begin_src emacs-lisp :tangle no :noweb-ref helpful-config
(setq helpful-max-buffers 10)
#+end_src

***** Show Documentation At Top Line

By default, Doom centers the page when you visit a source file. Often, I can't see the information behind the helpful window, so I remove the old advice and update it to display at the top of the screen.

#+begin_src emacs-lisp :tangle no :noweb-ref helpful-config
(advice-remove 'helpful--navigate #'+popup--helpful-open-in-origin-window-a)
#+end_src

#+begin_src emacs-lisp :tangle no :noweb-ref helpful-config
(defadvice! my/+popup--helpful-open-in-origin-window-a (button)
  "Open links in non-popup, originating window rather than helpful's window."
  :override #'helpful--navigate
  (let ((path (substring-no-properties (button-get button 'path)))
        enable-local-variables
        origin)
    (save-popups!
     (find-file path)
     (when-let (pos (get-text-property button 'position
                                       (marker-buffer button)))
       (goto-char pos))
     (setq origin (selected-window))
     (recenter 0)) ; Added argument 0 to cause recenter to top of screen.
    (select-window origin)))
#+end_src

** Completion
:PROPERTIES:
:VISIBILITY: children
:END:
*** Vertico

#+begin_quote
[[https://github.com/minad/vertico][Vertico]] provides a performant and compatible vertical completion UI for Emacs. It extends the minibuffer and =completing-read= commands.
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! vertico
  :defer t
  :config
  <<vertico-config>>)
#+end_src

**** Keybinds
***** Add Vim Scrolling Keybinds to Minibuffer

Luckily Doom doesn't use these yet and they can just be added.

#+begin_src emacs-lisp :tangle no :noweb-ref vertico-config
(map! :map vertico-map "C-u" #'scroll-down-command
      :map vertico-map "C-d" #'scroll-up-command)
#+end_src

*** Marginalia

#+begin_quote
[[https://github.com/minad/marginalia][Marginalia]] adds marks or annotations (marginalia) to the margin of the minibuffer for your completion candidates.
#+end_quote

*** Consult

#+begin_quote
[[https://github.com/minad/consult][Consult]] provides search and navigation commands to the minibuffer through =completing-read=.
#+end_quote

*** Orderless

#+begin_quote
[[https://github.com/oantolin/orderless][Orderless]] provides an =orderless= completion style for =completing-read= that divides the pattern into space-separated components, and matches candidates that match all of the components in any order.
#+end_quote

*** Embark

#+begin_quote
[[https://github.com/oantolin/embark][Embark]] provides an interface to choose a command based on the point in the buffer or minibuffer. You can think of it as a keyboard-based right-click menu.
#+end_quote

*** Corfu

#+begin_quote
[[https://github.com/minad/corfu][Corfu]] enhances in-buffer completion with a small completion popup. The current candidates are shown in a popup below or above the point, and can be selected by moving up and down. Corfu is the minimalistic in-buffer completion counterpart of the Vertico minibuffer UI.
#+end_quote

*** Which-Key

#+begin_quote
[[https://github.com/justbur/emacs-which-key][Which-Key]] is a minor mode that displays keybinds for your currently unfinished inputs.
#+end_quote
*** Sinister

#+begin_src emacs-lisp :tangle ./packages.el
(package! sinister
  :recipe (:host github :repo "positron-solutions/sinister")
  :pin "c8f24cb8aaf6d772d45f817d8bfd9eaa0b6a254c")
#+end_src

#+begin_src emacs-lisp :tangle ./config.el
(use-package! sinister)
#+end_src

*** Mini Ontop

#+begin_src emacs-lisp :tangle ./packages.el
(package! mini-ontop
  :recipe (:host github :repo "hkjels/mini-ontop.el")
  :pin "37a5dd35be310ca2752f04b64b8b17136503f505")
#+end_src

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! mini-ontop)
#+end_src

*** Stillness Mode

#+begin_src emacs-lisp :tangle ./packages.el
(package! stillness-mode
  :recipe (:host github :repo "neeasade/stillness-mode.el")
  :pin "05029febdb451941ed218e6ddbef5294776e31d4")
#+end_src

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! stillness-mode)
#+end_src

Currently this appears to work the best but there are scenarios that break it.

** Jumping
*** Avy

#+begin_quote
[[https://github.com/abo-abo/avy][Avy]] is a package for jumping to visible text using a char-based decision tree. Quickly jump to anything you see on your screen!
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! avy
  :defer t
  :config
  ;; Behavior
  (setq avy-all-windows t))
#+end_src

** Lookup
*** Lookup Providers

I don’t use most of the default providers (Google) so I set my own.

#+begin_src emacs-lisp :noeval :tangle ./config.el
(setq +lookup-provider-url-alist
      '(("DuckDuckGo" +lookup--online-backend-duckduckgo "https://duckduckgo.com/?q=%s")
        ("Debian Package" "https://packages.debian.org/search?keywords=%s")
        ("Github" "https://github.com/search?ref=simplesearch&q=%s")
        ("Youtube" "https://youtube.com/results?aq=f&oq=&search_query=%s")
        ("Wikipedia" "https://wikipedia.org/search-redirect.php?language=en&go=Go&search=%s")
        ("StackOverflow" "https://stackoverflow.com/search?q=%s")
        ("Doom Issues" "https://github.com/hlissner/doom-emacs/issues?q=is%%3Aissue+%s")
        ("Internet archive" "https://web.archive.org/web/*/%s")
        ("Project Gutenberg" "http://www.gutenberg.org/ebooks/search/?query=%s")
        ("MDN" "https://developer.mozilla.org/en-US/search?q=%s")
        ("Arch Wiki" "https://wiki.archlinux.org/index.php?search=%s&title=Special%3ASearch&wprov=acrw1")
        ("AUR" "https://aur.archlinux.org/packages?O=0&K=%s")))
#+end_src

* Utilities
:PROPERTIES:
:VISIBILITY: children
:END:
** Project Management
*** Projectile

#+begin_quote
[[https://github.com/bbatsov/projectile][Projectile]] is a project interaction library for Emacs. It provides easy project management and navigation.
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! projectile
  :defer t
  :init
  (setq projectile-project-search-path
        '(("~/.dotfiles" . 0)
          ("~/dev/projects" . 1)   ; My projects.
          ("~/dev/source" . 1)))   ; Other's code.
  :config
  ;; Behavior
  ;; - Disable automatic project discovery.
  (setq projectile-auto-discover nil
        projectile-track-known-projects-automatically nil)
  ;; Keybinds
  (map! :map project-prefix-map
        :leader
        :desc "List dirty projects"
        "p l" #'projectile-browse-dirty-projects))
#+end_src

