home/.config/doom/config.el
      :leader "t T" #'doom/toggle-profiler)

(map! :leader "t o" #'doom/set-frame-opacity)

(when (and (doom-font-exists-p "JetBrains Mono")
           (featurep :system 'linux))
           (setq doom-font (font-spec :family "JetBrains Mono" :size 14)
                 doom-big-font (font-spec :family "JetBrains Mono" :size 16)))

(setq doom-theme 'doom-one)

(map! :leader "h t" nil
      :leader "t t" #'load-theme)

(setq-default x-stretch-cursor t)

(when (and (featurep :system 'macos)
           (>= emacs-major-version 29))
           (add-to-list 'default-frame-alist '(undecorated-round . t)))

(when (and (featurep :system 'macos)
           (>= emacs-major-version 29))
      (setq frame-inhibit-implied-resize '(font font-backend tab-bar-lines)))

(map! "C-s-f" nil
      :leader "t F" nil)

(use-package! doom-modeline
  :defer t
  :config
  (setq doom-modeline-height 25
        doom-modeline-icon t
        doom-modeline-buffer-file-true-name t
        doom-modeline-project-detection 'auto
        doom-modeline-buffer-file-name-style 'relative-from-project
        doom-modeline-major-mode-icon nil
        doom-modeline-vcs-max-length 60
        auto-revert-check-vc-info t))

(setq display-line-numbers-type 'visual
      display-line-numbers-grow-only t)
(add-hook 'org-mode-hook #'doom-disable-line-numbers-h)

(setq +doom-dashboard-pwd-policy user-home-directory) ;; NOTE: uses personal constant.

(use-package! helpful
  :defer t
  :config
  (setq helpful-max-buffers 10)
  (advice-remove 'helpful--navigate #'+popup--helpful-open-in-origin-window-a)
  (defadvice! my/+popup--helpful-open-in-origin-window-a (button)
    "Open links in non-popup, originating window rather than helpful's window."
    :override #'helpful--navigate
    (let ((path (substring-no-properties (button-get button 'path)))
          enable-local-variables
          origin)
      (save-popups!
       (find-file path)
       (when-let (pos (get-text-property button 'position
                                         (marker-buffer button)))
         (goto-char pos))
       (setq origin (selected-window))
       (recenter 0)) ; Added argument 0 to cause recenter to top of screen.
      (select-window origin))))

(use-package! vertico
  :defer t
  :config
  (map! :map vertico-map "C-u" #'scroll-down-command
        :map vertico-map "C-d" #'scroll-up-command))

(use-package! sinister)

(use-package! mini-ontop)

(use-package! stillness-mode)

(use-package! avy
  :defer t
  :config
  ;; Behavior
  (setq avy-all-windows t))

(setq +lookup-provider-url-alist
      '(("DuckDuckGo" +lookup--online-backend-duckduckgo "https://duckduckgo.com/?q=%s")
        ("Debian Package" "https://packages.debian.org/search?keywords=%s")
        ("Github" "https://github.com/search?ref=simplesearch&q=%s")
        ("Youtube" "https://youtube.com/results?aq=f&oq=&search_query=%s")
        ("Wikipedia" "https://wikipedia.org/search-redirect.php?language=en&go=Go&search=%s")
        ("StackOverflow" "https://stackoverflow.com/search?q=%s")
        ("Doom Issues" "https://github.com/hlissner/doom-emacs/issues?q=is%%3Aissue+%s")
        ("Internet archive" "https://web.archive.org/web/*/%s")
        ("Project Gutenberg" "http://www.gutenberg.org/ebooks/search/?query=%s")
        ("MDN" "https://developer.mozilla.org/en-US/search?q=%s")
        ("Arch Wiki" "https://wiki.archlinux.org/index.php?search=%s&title=Special%3ASearch&wprov=acrw1")
        ("AUR" "https://aur.archlinux.org/packages?O=0&K=%s")))

(use-package! projectile
  :defer t
  :init
  (setq projectile-project-search-path
        '(("~/.dotfiles" . 0)
          ("~/dev/projects" . 1)   ; My projects.
          ("~/dev/source" . 1)))   ; Other's code.
  :config
  ;; Behavior
  ;; - Disable automatic project discovery.
  (setq projectile-auto-discover nil
        projectile-track-known-projects-automatically nil)
  ;; Keybinds
  (map! :map project-prefix-map
        :leader
        :desc "List dirty projects"
        "p l" #'projectile-browse-dirty-projects))
