home/.config/doom/packages.el

(package! sinister
  :recipe (:host github :repo "positron-solutions/sinister")
  :pin "c8f24cb8aaf6d772d45f817d8bfd9eaa0b6a254c")

(package! mini-ontop
  :recipe (:host github :repo "hkjels/mini-ontop.el")
  :pin "37a5dd35be310ca2752f04b64b8b17136503f505")

(package! stillness-mode
  :recipe (:host github :repo "neeasade/stillness-mode.el")
  :pin "05029febdb451941ed218e6ddbef5294776e31d4")

(package! denote
