home/.config/doom/doom.org
*** Magit

#+begin_quote
[[https://magit.vc][Magit]] is a powerful Git interface for Emacs. "It fills the glaring gap between the Git command-line interface and various GUIs, letting you perform trivial as well as elaborate version control tasks with just a couple of mnemonic key presses."
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! magit
  :defer t
  :config
  (setq magit-repository-directories
        '(("~/.dotfiles" . 0)
          ("~/dev/projects" . 1)   ; My projects.
          ("~/dev/source" . 1)))   ; Other's code.
  (require 'magit-lint)) ;; Load my custom commit linter.
#+end_src

** Terminal
*** Vterm

#+begin_quote
[[https://github.com/akermu/emacs-libvterm][Vterm]] is the most capable Emacs terminal emulator with unrivaled performance and compatibility.
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! vterm
  :defer t
  :init
  ;; Update Bash version on macOS if available.
  (when (and (featurep :system 'macos)
             (file-exists-p "/opt/homebrew/bin/bash"))
    (setq vterm-shell "/opt/homebrew/bin/bash"))
  :config
  ;; Keybinds
  ;; - Fix M-backspace keybind on macOS.
  (evil-define-key* 'insert vterm-mode-map (kbd "<M-backspace>") #'vterm-send-meta-backspace))
#+end_src

** Directory
*** Dired

#+begin_quote
Dired, the built-in directory editor is an interface to edit directories and their files.
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! dired
  :defer t)
#+end_src

*** Dirvish

#+begin_quote
Dirvish enhances Emacs’ built-in Dired mode, providing a visually appealing and highly customizable interface.

More than just a facelift, Dirvish delivers a comprehensive suite of features, transforming Dired into a modern and fully functional file manager.
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! dirvish
  :defer t
  :custom
  (dirvish-quick-access-entries
   '(("h" "~/" "Home")
     ("d" "~/.dotfiles/" "Dotfiles")
     ("o" "~/documents/org/" "Org")))
  :config
  (set-popup-rule! "^ ?\\*\\(?:[Dd]irvish\\|SIDE :: \\).*" :width 0.15 :ignore t :quit 'current))
#+end_src

** Organization
:PROPERTIES:
:VISIBILITY: children
:END:
*** Org

#+begin_quote
[[https://orgmode.org/][Org Mode]] describes itself as, "a GNU Emacs major mode for keeping notes, authoring documents, computational notebooks, literate programming, maintaining to-do lists, planning projects, and more — in a fast and effective plain text system."
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! org
  :defer t
  :init
  ;; Functions
  (defun org-file (path) ;; Inspired by jwiegley.
    "Return PATH expanded relative to org-directory.

- Intended for use with file names.
- PATH must not begin with a slash."
    (expand-file-name path org-directory))
  (defun org-subdirectory (subdir)
    "Return SUBDIR expanded as directory name relative to org-directory."
    (file-name-as-directory (org-file subdir)))
  ;; Variables
  (setq org-directory (file-truename "~/documents/org/") ;; NOTE: trailing slash denotes a directory.
        org-id-locations-file (expand-file-name "data/org-ids" org-directory)
        org-inbox-directory (org-subdirectory "inbox")
        org-inbox-file (expand-file-name (concat user-system-name ".org") org-inbox-directory))
  :config
  ;; Appearance
  (setq org-default-notes-file org-inbox-file   ; Set default notes file to inbox file.
        org-hide-leading-stars t                ; Hide leading stars.
        org-ellipsis " ▾ "                      ; Use UTF-8 to indicate folded heading.
        org-hidden-keywords nil                 ; Don't hide any TODO keywords.
        org-image-actual-width '(0.9)           ; Use an in-buffer image width closer to export's
        org-startup-with-inline-images t        ; Show images at startup.
        org-startup-with-latex-preview nil      ; Don't show LaTeX on startup.
        org-hide-emphasis-markers t             ; Hide syntax for emphasis. (Use org-appear)
        org-src-preserve-indentation t          ; Keep language specific indenting in source blocks.
        org-pretty-entities t)                  ; Show sub/superscript as UTF8.
  (setq org-property-format "%-10s %s")
  ;; Behavior
  ;; - General
  (setq org-list-allow-alphabetical t           ; Use alphabet as lists.
        org-use-property-inheritance t          ; Sub-headings inherit parent properties.
        org-imenu-depth 5                       ; Allow imenu to search deeply in org docs.
        org-return-follows-link t               ; Allow return to open links.
        org-insert-heading-respect-content nil  ; Insert heading here, not at end of list.
        org-use-fast-todo-selection 'auto)      ; Method to select TODO heading keywords.
  ;; - Logging
  (setq org-log-done 'time                      ; Add completion time to DONE items.
        org-log-into-drawer t                   ; Log times into a drawer to hide them.
        org-log-reschedule t                    ; Log rescheduling of scheduled items.
        org-log-redeadline t                    ; Log rescheduling of deadline items.
        org-treat-insert-todo-heading-as-state-change t
        org-log-states-order-reversed nil)      ; Log times reverse chronologically.
  ;; - Habits
  (add-to-list 'org-modules 'org-habit t)       ; Enable org-habit for tracking repeated actions.
  ;; - Calendar
  (setq evil-collection-calendar-want-org-bindings t) ; Use Evil keybinds to move in calendar.
  ;; - Tags
  ;; - Todos
  (setq org-todo-keywords
        '((sequence
           "TODO(t!)"      ; Task that needs doing & is ready to do.
           "NEXT(N!)"      ; Task that needs doing & is ready to do.
           "|"             ; Required to get org-roam to ignore the following todo items.
           "DONE(d!)"      ; Task successfully completed.
           "KILL(k@/!)")   ; Task cancelled or not applicable.
          (type
           "WAIT(w@/!)"    ; Task on hold by somthing.
           "SOMEDAY(s!)"   ; Task that could be done someday.
           "MAYBE(m!)"     ; Task that I might do someday.
           "BOOKMARK(b!)"  ; A link to be bookmarked.
           "ISSUE(I!)"     ; An issue.
           "IDEA(i!)"      ; An idea.
           "NOTE(n!)"))    ; A fleeting note, in person, idea, or link.
        org-todo-keyword-faces
        '(("TODO"  . +org-todo-active)
          ("NEXT" . +org-todo-active)
          ("WAIT" . +org-todo-onhold)
          ("SOMEDAY" . +org-todo-onhold)
          ("MAYBE" . +org-todo-onhold)
          ("PROJ" . +org-todo-project)
          ("DONE" . +org-todo-cancel)
          ("KILL" . +org-todo-cancel))))
#+end_src

*** Denote

#+begin_quote
[[https://github.com/protesilaos/denote][Denote]] is a simple note-taking tool for Emacs with an efficient file naming scheme.

It's based on the idea that notes should follow a predictable and descriptive file-naming scheme.
#+end_quote

#+begin_src emacs-lisp :tangle ./packages.el
(package! denote
  :recipe (:host github :repo "protesilaos/denote")
  :pin "3bb05f212cc29fa6953e6d703e5e0c2e982882a9")
#+end_src

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! denote
  :after org
  :config
  (setq denote-directory org-directory    ;; Use org-directory with denote.
        org-id-ts-format denote-id-format ;; Use denote-id-format for org-id.
        org-id-method 'ts                 ;; Use org-roam compatible front-matter.
        ;; Use Denote ID as date to avoid the org timestamp which is missing seconds.
        denote-date-format denote-id-format
        denote-org-front-matter ":PROPERTIES:\n:ID: %4$s\n:END:\n#+title: %1$s\n#+filetags: %3$s\n"))
#+end_src

