home/.config/doom/config.el

(use-package! magit
  :defer t
  :config
  (setq magit-repository-directories
        '(("~/.dotfiles" . 0)
          ("~/dev/projects" . 1)   ; My projects.
          ("~/dev/source" . 1)))   ; Other's code.
  (require 'magit-lint)) ;; Load my custom commit linter.

(use-package! vterm
  :defer t
  :init
  ;; Update Bash version on macOS if available.
  (when (and (featurep :system 'macos)
             (file-exists-p "/opt/homebrew/bin/bash"))
    (setq vterm-shell "/opt/homebrew/bin/bash"))
  :config
  ;; Keybinds
  ;; - Fix M-backspace keybind on macOS.
  (evil-define-key* 'insert vterm-mode-map (kbd "<M-backspace>") #'vterm-send-meta-backspace))

(use-package! dired
  :defer t)

(use-package! dirvish
  :defer t
  :custom
  (dirvish-quick-access-entries
   '(("h" "~/" "Home")
     ("d" "~/.dotfiles/" "Dotfiles")
     ("o" "~/documents/org/" "Org")))
  :config
  (set-popup-rule! "^ ?\\*\\(?:[Dd]irvish\\|SIDE :: \\).*" :width 0.15 :ignore t :quit 'current))

(use-package! org
  :defer t
  :init
  ;; Functions
  (defun org-file (path) ;; Inspired by jwiegley.
    "Return PATH expanded relative to org-directory.

- Intended for use with file names.
- PATH must not begin with a slash."
    (expand-file-name path org-directory))
  (defun org-subdirectory (subdir)
    "Return SUBDIR expanded as directory name relative to org-directory."
    (file-name-as-directory (org-file subdir)))
  ;; Variables
  (setq org-directory (file-truename "~/documents/org/") ;; NOTE: trailing slash denotes a directory.
        org-id-locations-file (expand-file-name "data/org-ids" org-directory)
        org-inbox-directory (org-subdirectory "inbox")
        org-inbox-file (expand-file-name (concat user-system-name ".org") org-inbox-directory))
  :config
  ;; Appearance
  (setq org-default-notes-file org-inbox-file   ; Set default notes file to inbox file.
        org-hide-leading-stars t                ; Hide leading stars.
        org-ellipsis " ▾ "                      ; Use UTF-8 to indicate folded heading.
        org-hidden-keywords nil                 ; Don't hide any TODO keywords.
        org-image-actual-width '(0.9)           ; Use an in-buffer image width closer to export's
        org-startup-with-inline-images t        ; Show images at startup.
        org-startup-with-latex-preview nil      ; Don't show LaTeX on startup.
        org-hide-emphasis-markers t             ; Hide syntax for emphasis. (Use org-appear)
        org-src-preserve-indentation t          ; Keep language specific indenting in source blocks.
        org-pretty-entities t)                  ; Show sub/superscript as UTF8.
  (setq org-property-format "%-10s %s")
  ;; Behavior
  ;; - General
  (setq org-list-allow-alphabetical t           ; Use alphabet as lists.
        org-use-property-inheritance t          ; Sub-headings inherit parent properties.
        org-imenu-depth 5                       ; Allow imenu to search deeply in org docs.
        org-return-follows-link t               ; Allow return to open links.
        org-insert-heading-respect-content nil  ; Insert heading here, not at end of list.
        org-use-fast-todo-selection 'auto)      ; Method to select TODO heading keywords.
  ;; - Logging
  (setq org-log-done 'time                      ; Add completion time to DONE items.
        org-log-into-drawer t                   ; Log times into a drawer to hide them.
        org-log-reschedule t                    ; Log rescheduling of scheduled items.
        org-log-redeadline t                    ; Log rescheduling of deadline items.
        org-treat-insert-todo-heading-as-state-change t
        org-log-states-order-reversed nil)      ; Log times reverse chronologically.
  ;; - Habits
  (add-to-list 'org-modules 'org-habit t)       ; Enable org-habit for tracking repeated actions.
  ;; - Calendar
  (setq evil-collection-calendar-want-org-bindings t) ; Use Evil keybinds to move in calendar.
  ;; - Tags
  ;; - Todos
  (setq org-todo-keywords
        '((sequence
           "TODO(t!)"      ; Task that needs doing & is ready to do.
           "NEXT(N!)"      ; Task that needs doing & is ready to do.
           "|"             ; Required to get org-roam to ignore the following todo items.
           "DONE(d!)"      ; Task successfully completed.
           "KILL(k@/!)")   ; Task cancelled or not applicable.
          (type
           "WAIT(w@/!)"    ; Task on hold by somthing.
           "SOMEDAY(s!)"   ; Task that could be done someday.
           "MAYBE(m!)"     ; Task that I might do someday.
           "BOOKMARK(b!)"  ; A link to be bookmarked.
           "ISSUE(I!)"     ; An issue.
           "IDEA(i!)"      ; An idea.
           "NOTE(n!)"))    ; A fleeting note, in person, idea, or link.
        org-todo-keyword-faces
        '(("TODO"  . +org-todo-active)
          ("NEXT" . +org-todo-active)
          ("WAIT" . +org-todo-onhold)
          ("SOMEDAY" . +org-todo-onhold)
          ("MAYBE" . +org-todo-onhold)
          ("PROJ" . +org-todo-project)
          ("DONE" . +org-todo-cancel)
          ("KILL" . +org-todo-cancel))))

(use-package! denote
  :after org
  :config
  (setq denote-directory org-directory    ;; Use org-directory with denote.
        org-id-ts-format denote-id-format ;; Use denote-id-format for org-id.
        org-id-method 'ts                 ;; Use org-roam compatible front-matter.
        ;; Use Denote ID as date to avoid the org timestamp which is missing seconds.
        denote-date-format denote-id-format
        denote-org-front-matter ":PROPERTIES:\n:ID: %4$s\n:END:\n#+title: %1$s\n#+filetags: %3$s\n"))

(use-package! org-roam
  :defer t
  :init
