home/.config/doom/doom.org
*** Org Roam

#+begin_quote
[[https://github.com/org-roam/org-roam][Org Roam]] is a plain-text knowledge management system.

It provides a solution for non-hierarchical note-taking and linking.
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! org-roam
  :defer t
  :init
  (setq org-roam-directory org-directory
        org-roam-db-location (expand-file-name "data/org-roam.db" org-roam-directory))
  :config
  (require 'org-roam-file)       ;; Integrates org-roam with org-agenda and denote.
  (require 'org-roam-include)    ;; Prevents certain files with org headings with org-id from being included in database.
  (setq org-roam-db-node-include-function #'org-roam-include-p
        org-roam-include-exclude-directories (list org-inbox-directory)
        org-roam-include-exclude-files (list "agenda.org" "bookmarks.org"))
  (setq org-roam-file-rename-exclude (append
                                      '("~/Documents/org/resource/bookmarks.org"
                                        "~/Documents/org/agenda.org"
                                        "~/Documents/org/system-overview.org")
                                      (directory-files org-inbox-directory 'full ".org$") nil))
  (require 'org-roam-tags)       ;; Automatic tag insertion after node insertion.
  (when (modulep! :ui modeline)
    (require 'org-roam-modeline) ;; Integrate doom-modeline with the denote file naming scheme under org-roam.
    (setq doom-modeline-buffer-file-name-function #'org-roam-modeline-process-buffer-file-name
          doom-modeline-buffer-file-truename-function #'org-roam-modeline-process-buffer-file-name)))
#+end_src

*** Capture
:PROPERTIES:
:VISIBILITY: children
:END:
**** Org Capture

#+begin_quote
Org Capture lets you quickly insert into your org documents.
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! org-capture
  :defer t
  :config
  (defun org-capture-id-get-created ()
    "Create an ID and CREATED property for the current entry.

Intended for use with `:before-finalize` keyword in `org-capture-templates`."
    (org-entry-put (point) "CREATED" (format-time-string "[%F %a %R]" (date-to-time (org-id-get-create)))))

  ;; NOTE: Does not support errors. Implicitly sets the id does not give option to pass in ID.
  ;; TODO: Rewrite.
  ;; TODO: Extend org-bookmark to use link capturing abilities.
  ;; (setq +org-capture-fn #'org-roam-capture)
  ;; (set-popup-rule! "^*Capture*$" :side 'bottom :height 1 :select nil :autosave 'ignore)
  ;; (set-popup-rule! "^CAPTURE-.*$" :side 'bottom :height 0.3 :vslot -1 :quit nil :select t :autosave 'ignore)
  (setq org-capture-bookmark nil
        org-capture-templates
        '(("t" "Task" entry
           (file org-inbox-file)
           "* TODO %?"
           :prepend t
           :before-finalize (org-capture-id-get-created)
           :empty-lines-before 1)
          ("n" "Note" entry
           (file org-inbox-file)
           "* NOTE %?"
           :prepend t
           :before-finalize (org-capture-id-get-created)
           :empty-lines-before 1)
          ("b" "Bookmark" entry
           (file org-inbox-file)
           "* BOOKMARK %?"
           :prepend t
           :before-finalize (org-capture-id-get-created)
           :empty-lines-before 1))))
  ;; Hidden templates used in certain context.
  ;; ("T" "Hidden Templated tasks.")
  ;; ("Ta" "Hidden Agenda tasks.")
  ;; ("Tah" "Task in Agenda Heading" entry
  ;;  (file org-inbox-file)
  ;;  "* TODO %?"
  ;;  :prepend t
  ;;  :before-finalize (org-id-get-create)
  ;;  :empty-lines-before 1)))
  ;; ))

  ;; (defun my/org-capture-context () (if (string= (buffer-file-name) (expand-file-name "~/Documents/org/agenda.org")) t nil))
  ;; (setq org-capture-templates-contexts
  ;;       '(("t" ((not-in-file .  "~/Documents/org/agenda.org")))
  ;;         ("n" ((not-in-file .  "~/Documents/org/agenda.org")))
  ;;         ("v" (my/org-capture-context))
  ;;         ("t" "v" (my/org-capture-context (in-file .  "~/Documents/org/agenda.org")))
  ;;         ))
  ;; ("t" "v" ((in-file . "~/Documents/org/agenda.org"))))
  ;; ("t" "n" (my/org-capture-context (in-file .  "~/Documents/org/agenda.org")))
  ;; Known to work:
  ;; ("v" (my/org-capture-context (in-file .  "~/Documents/org/agenda.org")))

  ;; )
;; ("t" "v" ((in-file . "~/Documents/org/agenda.org")
;; )
#+end_src

**** Org Roam Capture

#+begin_quote
Org Roam Capture extends the built-in Org Capture functionality with Org Roam specific template expansions, integration with node creation, and Org Roam Reference captures using Org Roam Ref Protocol!
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! org-roam-capture
  :defer t
  :config
  (setq org-roam-capture-templates
        '(("n" "node" plain "%?"
           :target (file+head "node/${id}--${slug}.org"
                              "#+title: ${title}\n")
           :unnarrowed t)
          ("p" "person" plain "%?"
           :target (file+head "resource/person/${id}--${slug}.org"
                              "#+title: ${title}\n#+filetags: :person:\n")))))
#+end_src

**** Org Roam Protocol

#+begin_quote
[[https://www.orgroam.com/manual.html#org_002droam_002dprotocol][Org Roam Protocol]] is an extension to org-roam for capturing content from external applications such as web browsers via org-protocol. It extends org-protocol with two more protocols: roam-node and roam-ref.
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! org-roam-protocol
  :defer t
  :config
  (setq org-roam-protocol-store-links t)
  (setq org-roam-capture-ref-templates
        '(("r" "ref" plain "*%?"
           :target (file+head "resource/reference/${id}--${slug}.org" "#+title: ${title}\n\n${body}")
           :unnarrowed t)
          ("b" "Bookmark" plain "%?"
           :target (file+olp "resource/bookmarks.org" ("*Testing"))
           :unnarrowed t
           :empty-lines-before 1))))
#+end_src

***** Setup
****** Org Roam Protocol

There's some basic steps to get this working, some people have had poor luck with it, thankfully I've automated most of it. ([[https://www.orgroam.com/manual.html#Mac-OS][Source]])

******* Linux

#+begin_src conf
[Desktop Entry]
Name=Org-Protocol
Exec=emacsclient %u
Icon=emacs-icon
Type=Application
Terminal=false
MimeType=x-scheme-handler/org-protocol
#+end_src

#+begin_src shell
update-desktop-database ~/.local/share/applications/
#+end_src

#+begin_src shell
xdg-mime default org-protocol.desktop x-scheme-handler/org-protocol
#+end_src

#+begin_src
open org-protocol://roam-ref\?template=b\&ref=test\&title=this
#+end_src

******* macOS

This ugly function uses Applescript and Emacs-Lisp to generate and customize an application (=OrgProtocolClient.app=) to act as our scheme handler for =org-protocol:= links. It's automatically installed in the applications directory and appears to automatically register itself as the handler for our new URI. On macOS any application in =/Applications= that has a =CFBundleURLTypes= value in its =Info.plist= will be registered as a handler for the URL schemes.

#+begin_src emacs-lisp :tangle no
(defun my/org-protocol-make-app-handler ()
  "Generate the Applescript application 'OrgProtocol.app' using Applescript and elisp."
  ;; TODO: Create options to change where the application gets created.
  (interactive)
  ;; TODO: Consider prompting are you sure?
  (let* ((script (expand-file-name "OrgProtocolClient.applescript" doom-user-dir))
         (app "/Applications/OrgProtocolClient.app")
         ;; NOTE: Once you've made the link succesffuly you should be able to update the app without a problem, otherwise, recursively run 'lsregister' until there's no app for that command. Could automate that eventually.
         (plist (expand-file-name "Contents/Info.plist" app))
         (emacsclient "/opt/homebrew/bin/emacsclient -n "))
    (with-temp-file script
      (insert "on open location this_URL\n")
      (insert (format "\tset EC to \"%s\"\n" emacsclient))
      (insert "\tset filePath to quoted form of this_URL\n")
      (insert "\tdo shell script EC & filePath\n")
      (insert "\ttell application \"Emacs\" to activate\n")
      (insert "end open location\n"))
    ;; Must be done for osacompile to recognize application extension.
    (when (file-exists-p app) (delete-directory app t))
    (let ((status (call-process-shell-command (format "osacompile -o %s %s" app script))))
      (if (eq status 0)
          (with-temp-file plist
            (when (file-exists-p script) (delete-file script t))
            (when-let  ((plist-buffer (get-file-buffer plist)))
              (kill-buffer plist-buffer))
            (insert-file-contents plist)
            (goto-char (point-max))
            (goto-char (re-search-backward "</dict>"))
            (previous-line) (end-of-line) (newline)
            (insert "\t<key>CFBundleURLTypes</key>\n")
            (insert "\t<array>\n")
            (insert "\t\t<dict>\n")
            (insert "\t\t\t<key>CFBundleURLName</key>\n")
            (insert "\t\t\t<string>org-protocol handler</string>\n")
            (insert "\t\t\t<key>CFBundleURLSchemes</key>\n")
            (insert "\t\t\t<array>\n")
            (insert "\t\t\t\t<string>org-protocol</string>\n")
            (insert "\t\t\t</array>\n")
            (insert "\t\t</dict>\n")
            (insert "\t</array>")
            (write-region nil nil plist))
        (error "Something wen't wrong with the compilation of the script!")))))
#+end_src

******* Bookmark

To use org-protocol to interact with the browser we can use the following bookmarklet written in Javascript. Simply add this to your browser to be able to send web links and information from them to Org Mode!

When using this with various browsers, you may need to enable the handler in the browser's settings manually. Some browsers just work and others require you to set it in the GUI settings, thankfully not in their text configuration.

#+begin_src javascript :tangle no
javascript:location.href =
    'org-protocol://roam-ref?template=b&ref='
    + encodeURIComponent(location.href)
    + '&title='
    + encodeURIComponent(document.title)
    + '&body='
    + encodeURIComponent(window.getSelection())
#+end_src

#+begin_src javascript :tangle no
javascript:location.href = 'org-protocol://roam-ref?template=b&ref=' + encodeURIComponent(location.href) + '&title=' + encodeURIComponent(document.title) + '&body=' + encodeURIComponent(window.getSelection())
#+end_src

#+begin_src javascript :tangle no :exports none
javascript:(function()%7Bvar%20url%20%3D%20document.URL%20%3B%0Avar%20title%20%3D%20document.title%20%3B%0Awindow.location.href%20%3D%20%22https%3A%2F%2Fwww.reddit.com%2Fr%2F%22%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%2B%20prompt(%22Subreddit%3A%20%22%2C%20%22%22)%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%2B%20%22%2Fsubmit%3Ftitle%3D%22%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%2B%20title%20%2B%20%22%26url%3D%22%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%2B%20url%20%3B%7D)()%3B
#+end_src

