home/.config/doom/config.el
  (setq org-roam-directory org-directory
        org-roam-db-location (expand-file-name "data/org-roam.db" org-roam-directory))
  :config
  (require 'org-roam-file)       ;; Integrates org-roam with org-agenda and denote.
  (require 'org-roam-include)    ;; Prevents certain files with org headings with org-id from being included in database.
  (setq org-roam-db-node-include-function #'org-roam-include-p
        org-roam-include-exclude-directories (list org-inbox-directory)
        org-roam-include-exclude-files (list "agenda.org" "bookmarks.org"))
  (setq org-roam-file-rename-exclude (append
                                      '("~/Documents/org/resource/bookmarks.org"
                                        "~/Documents/org/agenda.org"
                                        "~/Documents/org/system-overview.org")
                                      (directory-files org-inbox-directory 'full ".org$") nil))
  (require 'org-roam-tags)       ;; Automatic tag insertion after node insertion.
  (when (modulep! :ui modeline)
    (require 'org-roam-modeline) ;; Integrate doom-modeline with the denote file naming scheme under org-roam.
    (setq doom-modeline-buffer-file-name-function #'org-roam-modeline-process-buffer-file-name
          doom-modeline-buffer-file-truename-function #'org-roam-modeline-process-buffer-file-name)))

(use-package! org-capture
  :defer t
  :config
  (defun org-capture-id-get-created ()
    "Create an ID and CREATED property for the current entry.

Intended for use with `:before-finalize` keyword in `org-capture-templates`."
    (org-entry-put (point) "CREATED" (format-time-string "[%F %a %R]" (date-to-time (org-id-get-create)))))

  ;; NOTE: Does not support errors. Implicitly sets the id does not give option to pass in ID.
  ;; TODO: Rewrite.
  ;; TODO: Extend org-bookmark to use link capturing abilities.
  ;; (setq +org-capture-fn #'org-roam-capture)
  ;; (set-popup-rule! "^*Capture*$" :side 'bottom :height 1 :select nil :autosave 'ignore)
  ;; (set-popup-rule! "^CAPTURE-.*$" :side 'bottom :height 0.3 :vslot -1 :quit nil :select t :autosave 'ignore)
  (setq org-capture-bookmark nil
        org-capture-templates
        '(("t" "Task" entry
           (file org-inbox-file)
           "* TODO %?"
           :prepend t
           :before-finalize (org-capture-id-get-created)
           :empty-lines-before 1)
          ("n" "Note" entry
           (file org-inbox-file)
           "* NOTE %?"
           :prepend t
           :before-finalize (org-capture-id-get-created)
           :empty-lines-before 1)
          ("b" "Bookmark" entry
           (file org-inbox-file)
           "* BOOKMARK %?"
           :prepend t
           :before-finalize (org-capture-id-get-created)
           :empty-lines-before 1))))
  ;; Hidden templates used in certain context.
  ;; ("T" "Hidden Templated tasks.")
  ;; ("Ta" "Hidden Agenda tasks.")
  ;; ("Tah" "Task in Agenda Heading" entry
  ;;  (file org-inbox-file)
  ;;  "* TODO %?"
  ;;  :prepend t
  ;;  :before-finalize (org-id-get-create)
  ;;  :empty-lines-before 1)))
  ;; ))

  ;; (defun my/org-capture-context () (if (string= (buffer-file-name) (expand-file-name "~/Documents/org/agenda.org")) t nil))
  ;; (setq org-capture-templates-contexts
  ;;       '(("t" ((not-in-file .  "~/Documents/org/agenda.org")))
  ;;         ("n" ((not-in-file .  "~/Documents/org/agenda.org")))
  ;;         ("v" (my/org-capture-context))
  ;;         ("t" "v" (my/org-capture-context (in-file .  "~/Documents/org/agenda.org")))
  ;;         ))
  ;; ("t" "v" ((in-file . "~/Documents/org/agenda.org"))))
  ;; ("t" "n" (my/org-capture-context (in-file .  "~/Documents/org/agenda.org")))
  ;; Known to work:
  ;; ("v" (my/org-capture-context (in-file .  "~/Documents/org/agenda.org")))

  ;; )
;; ("t" "v" ((in-file . "~/Documents/org/agenda.org")
;; )

(use-package! org-roam-capture
  :defer t
  :config
  (setq org-roam-capture-templates
        '(("n" "node" plain "%?"
           :target (file+head "node/${id}--${slug}.org"
                              "#+title: ${title}\n")
           :unnarrowed t)
          ("p" "person" plain "%?"
           :target (file+head "resource/person/${id}--${slug}.org"
                              "#+title: ${title}\n#+filetags: :person:\n")))))

(use-package! org-roam-protocol
  :defer t
  :config
  (setq org-roam-protocol-store-links t)
  (setq org-roam-capture-ref-templates
        '(("r" "ref" plain "*%?"
           :target (file+head "resource/reference/${id}--${slug}.org" "#+title: ${title}\n\n${body}")
           :unnarrowed t)
          ("b" "Bookmark" plain "%?"
           :target (file+olp "resource/bookmarks.org" ("*Testing"))
           :unnarrowed t
           :empty-lines-before 1))))
