home/.config/doom/doom.org
*** Org Ql

#+begin_quote
[[https://github.com/alphapapa/org-ql][Org QL]] provides a query language for Org files. It offers two syntax styles: Lisp-like sexps and search engine-like keywords.
#+end_quote

#+begin_src emacs-lisp :tangle ./packages.el
(package! org-ql
  :recipe (:host github :repo "alphapapa/org-ql")
  :pin "98c62ab0a6c084ae4132110e24d9fe1ace91d363")
#+end_src

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! org-ql
  :defer t
  :after denote)

(use-package! org-ql-search
  :after org-roam
  :autoload org-dblock-write:org-ql)
#+end_src

*** Org Sidebar

#+begin_quote
[[https://github.com/alphapapa/org-sidebar][Org Sidebar]] presents helpful sidebars for Org buffers. Sidebars are customizable using [[https://github.com/alphapapa/org-ql][org-ql]] queries and [[https://github.com/alphapapa/org-super-agenda][org-super-agenda]] grouping.
#+end_quote

#+begin_src emacs-lisp :tangle ./packages.el
(package! org-sidebar
  :recipe (:host github :repo "alphapapa/org-sidebar")
  :pin "1e06d1b4ab5f0d09301712cdecb757c9437a7179")
#+end_src

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! org-sidebar
  :after org)
#+end_src

** Ebooks
*** PDF Tools
* Languages
:PROPERTIES:
:VISIBILITY: children
:END:
** Shell
*** Sh-Script

#+begin_quote
Sh-Script is a built-in library that provides a major mode for editing shell scripts.
#+end_quote

#+begin_src emacs-lisp :tangle ./config.el :noweb yes
(use-package! sh-script
  :defer t
  :init
  <<sh-script-init>>
  :config
  <<sh-script-config>>)
#+end_src

**** Behavior
***** Ensure Shell is Bash

Load my own file template specifying Bash explicitly.

For some reason, the detection of the correct shell appears to work, except in templates.

#+begin_src emacs-lisp :tangle no :noweb-ref sh-script-init
(set-file-template! "\\.sh" :trigger "__sh" :mode 'sh-mode)
#+end_src

***** Formatter Rules (shfmt)

Doom provides some basic arguments to [[https://github.com/mvdan/sh][shfmt]] but those aren't enough for my preferences so I add my own.

#+begin_src emacs-lisp :tangle no :noweb-ref sh-script-config
(set-formatter! 'shfmt
  '("shfmt" "-filename" filepath "-ci" "-bn" "-sr" "-ln"
    (pcase sh-shell (`bash "bash") (`mksh "mksh") (_ "posix"))
    (when apheleia-formatters-respect-indent-level
      (list "-i"
            (number-to-string
             (cond
              (indent-tabs-mode 0)
              ((boundp 'sh-basic-offset)
               sh-basic-offset)
              (t 4))))))
  :modes '(sh-mode))
#+end_src

***** Open Bash Info Page

This is a simple interactive function that I call to quickly jump to the info page for Bash.

#+begin_src emacs-lisp :tangle no :noweb-ref sh-script-config
(defun my/bash-info-page ()
  "Go to the Bash info page."
  (interactive)
  (info "Bash"))
#+end_src

* Experiments
