home/.config/doom/config.el

(use-package! org-ql
  :defer t
  :after denote)

(use-package! org-ql-search
  :after org-roam
  :autoload org-dblock-write:org-ql)

(use-package! org-sidebar
  :after org)

(use-package! sh-script
  :defer t
  :init
  (set-file-template! "\\.sh" :trigger "__sh" :mode 'sh-mode)
  :config
  (set-formatter! 'shfmt
    '("shfmt" "-filename" filepath "-ci" "-bn" "-sr" "-ln"
      (pcase sh-shell (`bash "bash") (`mksh "mksh") (_ "posix"))
      (when apheleia-formatters-respect-indent-level
        (list "-i"
              (number-to-string
               (cond
                (indent-tabs-mode 0)
                ((boundp 'sh-basic-offset)
                 sh-basic-offset)
                (t 4))))))
    :modes '(sh-mode))
  (defun my/bash-info-page ()
    "Go to the Bash info page."
    (interactive)
    (info "Bash")))
