home/.config/doom/packages.el
  :recipe (:host github :repo "alphapapa/org-ql")
  :pin "98c62ab0a6c084ae4132110e24d9fe1ace91d363")

(package! org-sidebar
  :recipe (:host github :repo "alphapapa/org-sidebar")
  :pin "1e06d1b4ab5f0d09301712cdecb757c9437a7179")
